function PrivacyPolicy() {
  return (
    <div className="flex justify-center items-center min-h-screen pt-20">
      <div>
        <h1>개인정보 처리방침</h1>
        <br />
        <p>
          [맛P.T] (이하 TastePT)는 사용자의 개인정보를 중요하게 생각하며,
          개인정보 보호법 등 관련 법령을 준수하여 사용자의 개인정보를 처리하고
          있습니다. 본 개인정보 처리방침은 서비스 제공 과정에서 수집된
          개인정보의 이용목적, 수집항목, 보유기간, 제3자 제공 등과 관련된 사항을
          안내합니다.
        </p>

        <br />
        <h2>1. 수집하는 개인정보 항목</h2>
        <p>
          당사는 서비스 제공을 위해 아래와 같은 개인정보를 수집할 수 있습니다.
        </p>

        <br />
        <p>
          회원 가입 시: 이메일 주소, 비밀번호, 닉네임, 성별, 나이, 선호 음식,
          알러지
        </p>
        <p>서비스 이용 시: IP 주소, 쿠키, 방문 일시, 이용 기록</p>
        <p>결제 시: 결제 정보 (결제 관련 서비스 제공자가 제공하는 정보)</p>

        <br />
        <h2>2. 개인정보의 수집 및 이용 목적</h2>
        <p>당사는 수집한 개인정보를 다음의 목적을 위해 사용합니다.</p>

        <br />
        <p>회원 가입 및 관리</p>
        <p>
          서비스 제공 및 운영 (예: 로그인, 회원 관리, 사용자 맞춤형 서비스 제공)
        </p>
        <p>서비스 이용에 대한 통계 및 분석</p>
        <p>서비스 관련 고지 사항 전달</p>
        <p>법적 의무 이행 (예: 법적 분쟁 해결 및 관련 기관 제출)</p>

        <br />
        <h2>3. 개인정보의 보유 및 이용 기간</h2>
        <p>
          당사는 수집된 개인정보를 서비스 제공 목적이 달성되면 지체 없이
          파기합니다. 다만, 관련 법령에 따라 일정 기간 보유해야 할 경우, 해당
          기간 동안 개인정보를 보관합니다. 예를 들어, 상법, 전자상거래법
          등에서는 일정 기간 동안 거래 기록을 보관해야 합니다.
        </p>

        <br />
        <h2>4. 개인정보의 제3자 제공</h2>
        <p>
          당사는 원칙적으로 사용자의 개인정보를 제3자에게 제공하지 않습니다.
          다만, 사용자의 동의를 받거나 법적 의무에 따라 제공할 경우가 있을 수
          있습니다.
        </p>

        <br />
        <h2>5. 개인정보 처리의 위탁</h2>
        <p>
          당사는 서비스 제공을 위해 개인정보 처리 업무를 외부에 위탁할 수
          있습니다. 위탁받은 업체는 계약을 통해 개인정보 보호 관련 의무를
          이행해야 하며, 개인정보를 외부에 유출하거나 목적 외 용도로 사용하지
          않도록 관리합니다.
        </p>

        <br />
        <h2>6. 이용자의 권리</h2>
        <p>
          이용자는 언제든지 본인의 개인정보에 대해 열람, 수정, 삭제를 요구할 수
          있습니다. 또한, 개인정보 처리에 대해 동의한 경우 이를 철회할 수
          있습니다. 개인정보의 열람, 수정, 삭제를 원하시면 이메일로 문의 주시기
          바랍니다.
        </p>

        <br />
        <h2>7. 개인정보 보호를 위한 기술적/관리적 보호 조치</h2>
        <p>
          당사는 사용자의 개인정보 보호를 위해 아래와 같은 기술적, 관리적 보호
          조치를 취하고 있습니다.
        </p>

        <br />
        <p>개인정보 암호화</p>
        <p>악성 프로그램에 대한 보안 시스템 구축</p>
        <p>개인정보 접근 제한 및 권한 관리</p>

        <br />
        <h2>8. 개인정보 처리방침의 변경</h2>
        <p>
          당사는 개인정보 처리방침을 수시로 변경할 수 있으며, 변경 사항은 서비스
          내 공지사항 또는 이메일을 통해 고지합니다. 변경된 개인정보 처리방침은
          고지 후 즉시 시행됩니다.
        </p>

        <br />
        <h2>9. 연락처</h2>
        <p>
          개인정보 처리에 관한 문의나 요청 사항은 아래의 연락처로 연락주시면
          신속하게 처리하겠습니다.
        </p>
        <br />
        <p>이메일: [이메일 주소]</p>
        <p>전화: [전화번호]</p>
        <p>주소: [회사 주소]</p>
      </div>
    </div>
  );
}

export default PrivacyPolicy;
