function TermsOfService() {
  return (
    <div className="flex justify-center items-center min-h-screen pt-20">
      <div>
        <h1>이용약관</h1>
        <br />
        <h2>1. 총칙</h2>
        <p>
          1.1 서비스 제공자는 본 약관을 기준으로 이용자에게 서비스를 제공합니다.
        </p>
        <p>
          1.2 본 약관은 이용자가 서비스에 접속하거나 사용할 때 자동으로
          적용됩니다.
        </p>
        <br />
        <h2>2. 서비스의 이용</h2>
        <p>
          2.1 서비스 내용: 본 서비스는 사용자에게 요리와 관련된 기능을 제공하며,
          그 외의 부가 서비스가 포함될 수 있습니다.
        </p>
        <p>
          2.2 이용자의 의무: 이용자는 서비스를 사용하면서 제공된 약관을 준수해야
          하며, 불법적인 목적이나 기타 규정을 위반하는 행동을 하지 않아야
          합니다.
        </p>
        <br />
        <h2>3. 회원가입 및 계정</h2>
        <p>
          3.1 이용자는 서비스를 사용하기 위해 회원가입을 해야 하며, 등록된
          이메일 및 비밀번호를 사용하여 로그인합니다.
        </p>
        <p>
          3.2 이용자는 자신의 계정을 안전하게 보호해야 하며, 타인에게 계정을
          양도하거나 공유할 수 없습니다.
        </p>
        <br />
        <h2>4. 서비스 제공의 중지 및 종료</h2>
        <p>
          4.1 서비스 제공자는 이용자의 부당한 활동 또는 서비스 정책 위반 시 해당
          계정을 제한하거나 중지할 수 있습니다.
        </p>
        <p>
          4.2 서비스는 일정한 사유로 중단될 수 있으며, 이에 대해 이용자에게 사전
          고지 없이 서비스 종료될 수 있습니다.
        </p>
        <br />
        <h2>5. 저작권 및 지적 재산권</h2>
        <p>
          5.1 본 서비스에 포함된 모든 콘텐츠(텍스트, 이미지, 영상 등)는
          저작권법에 의해 보호받습니다. 이용자는 서비스 제공자의 허락 없이 이를
          무단으로 복제, 배포하거나 수정할 수 없습니다.
        </p>
        <br />
        <h2>6. 서비스의 책임 한계</h2>
        <p>
          6.1 서비스 제공자는 서비스 이용 중 발생할 수 있는 직접적 또는 간접적인
          손해에 대해 책임을 지지 않습니다.
        </p>
        <p>
          6.2 서비스 이용 시 발생할 수 있는 데이터 손실이나 기타 기술적 문제에
          대해 책임을 지지 않으며, 이용자는 이를 사전에 인지하고 이용해야
          합니다.
        </p>
        <br />
        <h2>7. 개인정보 처리방침</h2>
        <p>
          7.1 서비스 제공자는 이용자의 개인정보를 개인정보 처리방침에 명시된
          목적에 맞게 처리하며, 해당 방침은 별도의 문서로 제공됩니다.
        </p>
        <p>
          7.2 이용자는 본 약관을 읽고 동의한 후 서비스를 이용해야 하며,
          개인정보에 대한 관리 책임은 이용자 본인에게 있습니다.
        </p>
        <br />
        <h2>8. 약관의 변경</h2>
        <p>
          8.1 서비스 제공자는 약관의 변경이 필요할 경우 사전 고지를 통해
          변경사항을 공지합니다.
        </p>
        <p>
          8.2 이용자는 변경된 약관에 동의하지 않을 경우, 서비스 이용을 중단할 수
          있습니다.
        </p>
        <br />
        <h2>9. 법적 분쟁 해결</h2>
        <p>
          9.1 이용 약관과 관련된 분쟁이 발생할 경우, 서비스 제공자의 본사 소재지
          법원을 관할 법원으로 합니다.
        </p>
      </div>
    </div>
  );
}

export default TermsOfService;
